Repository: MelissaFrncJrg/tpAngular-CardGame
Catalog: client/src/locale/messages.*.xlf
Languages: fr

# backToCards
source: <fa-icon [icon]="faArrowLeft"></fa-icon> Back to cards list
fr: Retour à la liste des cartes

source: Card details
fr: Détail des cartes

source: Name
fr: Nom

source: Value
fr: Valeur

source: Save
fr: Enregistrer

source: Cancel
fr: Annuler

# update
source: <fa-icon class="icon" [icon]="faPenSquare"></fa-icon>Update
fr: <fa-icon class="icon" [icon]="faPenSquare"></fa-icon>Metre à jour

# delete
source: <fa-icon class="icon" [icon]="faTrash"></fa-icon>Delete
fr: <fa-icon class="icon" [icon]="faTrash"></fa-icon>Supprimer

# cardsTitle
source: Cards list
fr: Liste des cartes

source: New card
fr: Nouvelle carte

# decksTitle
source: My Decks
fr: Mes decks

# strength
source: Strength: {{ getDeckValue(deck) }}
fr: Force: {{ getDeckValue(deck) }}

source: New deck
fr: Nouveau deck

source: Deck Name
fr: Nom du deck

# cardsSelected
source: Cards selected: {{ selectedCards.length }} / 5
fr: Cartes sélectionnées: {{ selectedCards.length }} / 5

# totalStrength
source: Total strength: {{ getTotalValue() }} / 30
fr: Force totale: {{ getTotalValue() }} / 30

source: Available cards
fr: Cartes disponibles

# selectDeck
source: Select your deck
fr: Sélectionnez votre deck

# cards
source: Cards: {{ deck.cards.length }}
fr: Cartes:

# playerDeck
source: Your deck : {{ playerDeck?.name }}
fr: Votre deck : {{ playerDeck?.name }}

# ready
source: Ready (reveal cards)
fr: Prêt (révéler les cartes)

# score
source: Your score {{ playerScore }} - Opponent score {{ opponentScore }}
fr: Votre score {{ playerScore }} - Score de l'adversaire {{ opponentScore }}

source: Game over !
fr: Partie terminée !

# finalScore
source: Final score : You {{ playerScore }} - Opponent {{ opponentScore }}
fr: Score final : Vous {{ playerScore }} - Adversaire {{ opponentScore }}

# win
source: You win!
fr: Vous avez gagné !

# loose
source: You loose...
fr: Vous avez perdu...

source: Draw!
fr: Égalité !

# replay
source: New game
fr: Nouvelle partie

source: Play
fr: Jouer

# welcome
source: Welcome to your card game
fr: Bienvenue sur votre jeu de cartes

# login
source: Please login to your account
fr: Connectez-vous

# pwd
source: Password
fr: Mot de passe

# noAccount
source: Don't have an account? <a href="#" (click)="isLoginView = false">Create one</a>
fr: Vous n'avez pas de compte? <a href="#" (click)="isLoginView = false">Créez-en un</a>

# createAccount
source: Create your account
fr: Créez un compte

source: Register
fr: S'inscrire

source: Back to login
fr: Connexion

# load
source: Loading...
fr: Chargement

# noItems
source: No items have been created yet
fr: Aucun item créé

# loadCardError
source: Error when trying to load this card.
fr: Une erreur est survenue durant le chargement de cette carte

# updateCardError
source: Failed to update the card.
fr: Erreur lors de la mise à jour de la carte

# deleteCardInDeckError
source: You can’t delete a card that is part of a deck.
fr: Vous ne pouvez pas supprimer une carte présente dans un deck

# confirmDeleteCard
source: Are you sure you want to delete this card?
fr: Êtes-vous sûr de vouloir supprimer cette carte?

# deleteCardError
source: Failed to delete the card.
fr: Erreur lors de la suppression de la carte

# verifyDecksError
source: Failed to verify decks.
fr: Erreur lors de la vérification des decks

source: Error loading cards.
fr: Erreur lors du chargement des cartes

# fillAllFields
source: Please complete all required fields.
fr: Veuillez remplir tous les champs obligatoires.

source: Error creating card.
fr: Une erreur est survenue lors de la création de la carte

source: Error loading decks.
fr: Une erreur est survenue lors du chargement des decks.

# deckNameRequired
source: Deck name is required.
fr: Le nom du deck est obligatoire.

# deckFiveCards
source: A deck must contain exactly 5 cards.
fr: Un deck doit contenir 5 cartes.

# deckCreated
source: Deck createdDeck.name created successfully!
fr: Deck createdDeck.name créé avec succès!

source: Error creating deck.
fr: Erreur lors de la création du deck

source: Invalid deck data.
fr: Les données du deck sont invalides

# deckUpdated
source: Deck updatedDeck.name updated!
fr: Deck updatedDeck.name mis à jour !

source: Error updating deck.
fr: Une erreur est survenue lors de la mise à jour du deck.

# deckLimitedCards
source: Decks are limited to 5 cards.
fr: Les decks sont limités à 5 cartes

# deckMaxTotal
source: Deck total value cannot exceed 30.
fr: La force totale du deck ne doit pas dépasser 30.

# deckDeleted
source: Deck deleted successfully.
fr: Deck supprimé avec succès

source: Error deleting deck.
fr: Une erreur est survenue lors de la suppression du deck

# confirmDeleteDeck
source: This action is definitive. Are you sure you want to delete this deck?
fr: Cette action est définitive. Êtes-vous sûr de vouloir supprimer ce deck?

source: Failed to load cards.
fr: Une erreur est survenue lors du chargement des cartes

# noAvailableDecks
source: No available decks for opponent.
fr: Aucun deck disponible pour l'adversaire

# alreadyPlayed
source: You already played this card.
fr: Vous avez déjà joué cette carte

# chooseCardFirst
source: You must choose a card to start the game!
fr: Vous devez choisir une carte pour démarrer la partie!

# createUserError
source: Error when trying to create user
fr: Une erreur est survenue lors de la création du compte.

# loginError
source: Error when trying to log in
fr: Une erreur est survenue lors de la tentative de connexion

# cardsCount
source: Cards: {{ deck.cards.length }}
fr: Cartes: {{ deck.cards.length }}

# forbiddenCharsName
source: Forbidden characters detected in name.
fr: Caractères interdits détectés dans le nom.

# invalidName
source: Name must contain only letters and be under 100 characters.
fr: Le nom doit contenir uniquement des lettres et faire moins de 100 caractères.

# forbiddenCharsLogin
source: Forbidden characters detected in email.
fr: Caractères interdits détectés dans l'email.

# invalidEmail
source: Invalid email format or too long.
fr: Format d'email invalide ou trop long.

# forbiddenCharsPassword
source: Forbidden characters detected in password.
fr: Caractères interdits détectés dans le mot de passe.

# passwordLengthError
source: Password must be between 8 and 20 characters long.
fr: Le mot de passe doit contenir entre 8 et 20 caractères.

# invalidPassword
source: Password must contain one uppercase letter, one lowercase letter, and one number.
fr: Le mot de passe doit contenir une majuscule, une minuscule et un chiffre.
